app/Models/Modelpelanggan.php

    public function getPelanggan()
    {
        $builder = $this->db->table('pelanggan');
        return $builder->get();
---
SELECT *
FROM `pelanggan`